Autodesk.AdvanceSteel.Modelling.FoldedPlate.CreateFoldedPlate(Autodesk.AdvanceSteel.Modelling.Plate,Autodesk.AdvanceSteel.Modelling.Plate,Autodesk.AdvanceSteel.Geometry.Point3d,Autodesk.AdvanceSteel.Geometry.Point3d,System.Int32,System.Int32,Autodesk.AdvanceSteel.CADLink.Database.ObjectId[]@)
Creates a foldede plate by connecting 2 plates
pPlate1: First plate
pPlate2: Second plate
ptPlate1: Point on first plate, to help determine the best way to connect them.
Ideally place this point on the edge closer to the future connection line between the two plates.
ptPlate2: Point on second plate, to help determine the best way to connect them.
Ideally place this point on the edge closer to the future connection line between the two plates.
nFoldId1: Id of the fold to be connected from the first plate in case the first plate is actually a folded plate.
nFoldId2: Id of the fold to be connected from the second plate in case the second plate is actually a folded plate.
featureObjectIds: List of features created or transferred to the resulting folded plate.
Returns: The newly created folded plate, obtained by transforming the second plate to connect to the first along the specified edges,
already added to the objects database.
Creates a foldede plate by connecting 2 plates
pPlate1: First plate
pPlate2: Second plate
ptPlate1: Point on first plate, to help determine the best way to connect them.
Ideally place this point on the edge closer to the future connection line between the two plates.
ptPlate2: Point on second plate, to help determine the best way to connect them.
Ideally place this point on the edge closer to the future connection line between the two plates.
nFoldId1: Id of the fold to be connected from the first plate in case the first plate is actually a folded plate.
nFoldId2: Id of the fold to be connected from the second plate in case the second plate is actually a folded plate.
featureObjectIds: List of features created or transferred to the resulting folded plate.
Returns: The newly created folded plate, obtained by transforming the second plate to connect to the first along the specified edges,
already added to the objects database.

Autodesk.AdvanceSteel.Modelling.FoldedPlate.CreateFoldedPlate(Autodesk.AdvanceSteel.Modelling.Plate,Autodesk.AdvanceSteel.Modelling.Plate,Autodesk.AdvanceSteel.Geometry.Point3d,Autodesk.AdvanceSteel.Geometry.Point3d,System.Int32,System.Int32,Autodesk.AdvanceSteel.CADLink.Database.ObjectId[]@,System.Int32)
Creates a foldede plate by connecting 2 plates
pPlate1: First plate
pPlate2: Second plate
ptPlate1: Point on first plate, to help determine the best way to connect them.
Ideally place this point on the edge closer to the future connection line between the two plates.
ptPlate2: Point on second plate, to help determine the best way to connect them.
Ideally place this point on the edge closer to the future connection line between the two plates.
nFoldId1: Id of the fold to be connected from the first plate in case the first plate is actually a folded plate.
nFoldId2: Id of the fold to be connected from the second plate in case the second plate is actually a folded plate.
featureObjectIds: List of features created or transferred to the resulting folded plate.
nMethod: Valid values here are:
"0" which means connect by moving the second plate to touch the first; both plates contours remain unchanged in this case.
"1" which means connect by finding an intersecting line between the plates definition planes and modify/extend/cut
the plates contours in such a way that they have a common edge along that line.
Returns: The newly created folded plate, already added to the objects database.
Creates a foldede plate by connecting 2 plates
pPlate1: First plate
pPlate2: Second plate
ptPlate1: Point on first plate, to help determine the best way to connect them.
Ideally place this point on the edge closer to the future connection line between the two plates.
ptPlate2: Point on second plate, to help determine the best way to connect them.
Ideally place this point on the edge closer to the future connection line between the two plates.
nFoldId1: Id of the fold to be connected from the first plate in case the first plate is actually a folded plate.
nFoldId2: Id of the fold to be connected from the second plate in case the second plate is actually a folded plate.
featureObjectIds: List of features created or transferred to the resulting folded plate.
nMethod: Valid values here are:
"0" which means connect by moving the second plate to touch the first; both plates contours remain unchanged in this case.
"1" which means connect by finding an intersecting line between the plates definition planes and modify/extend/cut
the plates contours in such a way that they have a common edge along that line.
Returns: The newly created folded plate, already added to the objects database.

Autodesk.AdvanceSteel.Modelling.FoldedPlate.Update
Performs some validation and recalculation of the relations between all folds in the folded plate.
Performs some validation and recalculation of the relations between all folds in the folded plate.

Autodesk.AdvanceSteel.Modelling.FoldedPlate.ExtendBy(Autodesk.AdvanceSteel.Modelling.PlateFold,System.Int32,Autodesk.AdvanceSteel.Geometry.Point3d,Autodesk.AdvanceSteel.Geometry.Point3d)
Extends a folded plate with an additional "fold".
pPlateFold: A new plate fold to be added to this folded plate.
Do not manually add this PlateFold to the foldede plate before or after this operation.
nIdxFoldToConnectTo: The id of an existing plate fold, that is already part of the folded plate
and to which this new fold should be connected.
ptRelStart: Start point of the bending "relation" between the two folds.
ptRelEnd: End point of the bending "relation" between the two folds.
The two folds will only be connected along an area defined by the start and end points passed here,
and the order of the start and end points is also very important, it acts as a normal
for the bending arc. Passing these parameters in the wrong order will result in an invalid foldede plate.
Returns: Id of the newly added fold
Extends a folded plate with an additional "fold".
pPlateFold: A new plate fold to be added to this folded plate.
Do not manually add this PlateFold to the foldede plate before or after this operation.
nIdxFoldToConnectTo: The id of an existing plate fold, that is already part of the folded plate
and to which this new fold should be connected.
ptRelStart: Start point of the bending "relation" between the two folds.
ptRelEnd: End point of the bending "relation" between the two folds.
The two folds will only be connected along an area defined by the start and end points passed here,
and the order of the start and end points is also very important, it acts as a normal
for the bending arc. Passing these parameters in the wrong order will result in an invalid foldede plate.
Returns: Id of the newly added fold

Autodesk.AdvanceSteel.Modelling.FoldedPlate.ExtendBy(Autodesk.AdvanceSteel.Modelling.PlateFold,System.Int32,Autodesk.AdvanceSteel.Geometry.Point3d,Autodesk.AdvanceSteel.Geometry.Point3d,System.Double)
Extends a folded plate with an additional "fold".
pPlateFold: A new plate fold to be added to this folded plate.
Do not manually add this PlateFold to the foldede plate before or after this operation.
nIdxFoldToConnectTo: The id of an existing plate fold, that is already part of the folded plate
and to which this new fold should be connected.
ptRelStart: Start point of the bending "relation" between the two folds.
ptRelEnd: End point of the bending "relation" between the two folds.
The two folds will only be connected along an area defined by the start and end points passed here,
and the order of the start and end points is also very important, it acts as a normal
for the bending arc. Passing these parameters in the wrong order will result in an invalid foldede plate.
dRelationRadius: Radius of the bending at the connection "line" between the two folds.
This value is not an absolute value, but rather a multiplication factor. The final value of the radius
will be equal to the value you are passing in multiplied with the plate thickness.
Returns: Id of the newly added fold
Extends a folded plate with an additional "fold".
pPlateFold: A new plate fold to be added to this folded plate.
Do not manually add this PlateFold to the foldede plate before or after this operation.
nIdxFoldToConnectTo: The id of an existing plate fold, that is already part of the folded plate
and to which this new fold should be connected.
ptRelStart: Start point of the bending "relation" between the two folds.
ptRelEnd: End point of the bending "relation" between the two folds.
The two folds will only be connected along an area defined by the start and end points passed here,
and the order of the start and end points is also very important, it acts as a normal
for the bending arc. Passing these parameters in the wrong order will result in an invalid foldede plate.
dRelationRadius: Radius of the bending at the connection "line" between the two folds.
This value is not an absolute value, but rather a multiplication factor. The final value of the radius
will be equal to the value you are passing in multiplied with the plate thickness.
Returns: Id of the newly added fold

Autodesk.AdvanceSteel.Modelling.FoldedPlate.#ctor(Autodesk.AdvanceSteel.Geometry.Plane,Autodesk.AdvanceSteel.Geometry.Point3d,System.Double,System.Double,System.Double)
Creates a new Folded plate that will contain a single, rectangular "fold".
plane: Plane in which to create the first/main fold.
This plane will be used as a coordinate system as well:
the origin, x, y axes and normal that were used to contruct the plane matter.
ptCenter: center of the plate fold to be created.
This point must not be describing a WCS position, but rather a position
in the "plane" coordinate system passed as the first parameter.
dLength: Length of the fold.
dWidth: Width of the rectangular fold.
dThickness: Thickness of the folded plate.
Creates a new Folded plate that will contain a single, rectangular "fold".
plane: Plane in which to create the first/main fold.
This plane will be used as a coordinate system as well:
the origin, x, y axes and normal that were used to contruct the plane matter.
ptCenter: center of the plate fold to be created.
This point must not be describing a WCS position, but rather a position
in the "plane" coordinate system passed as the first parameter.
dLength: Length of the fold.
dWidth: Width of the rectangular fold.
dThickness: Thickness of the folded plate.